<a href="https://colab.research.google.com/github/Ankur08kv/improved-octo-carnival/blob/main/pandas_functionality.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [21]:
my_dict = { 'name':["a","b","c"],
           'age' : [21,40,53],
           'designation' : ["student","prof.","HOD"]}

In [22]:
my_dict

{'age': [21, 40, 53],
 'designation': ['student', 'prof.', 'HOD'],
 'name': ['a', 'b', 'c']}

In [23]:
df = pd.DataFrame(my_dict)
df

  name  age designation
0    a   21     student
1    b   40       prof.
2    c   53         HOD

In [24]:
df.to_csv('csv_file', index = False)

In [25]:
df_csv = pd.read_csv('csv_file')
df_csv

  name  age designation
0    a   21     student
1    b   40       prof.
2    c   53         HOD